<?xml version="1.0" ?>
<net name="embedding_exemplar_subnet" version="10">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,90,160"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input/reverse_input_channels/Concat793_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="96,3,11,11" size="69696"/>
			<output>
				<port id="1" precision="FP16">
					<dim>96</dim>
					<dim>3</dim>
					<dim>11</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>90</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>3</dim>
					<dim>11</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="69696" shape="1,96,1,1" size="192"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>75</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/re_lu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/max_pooling2d/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="3,3" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d_1/Conv2D/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="69888" shape="256,96,5,5" size="1228800"/>
			<output>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>96</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>19</dim>
					<dim>37</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>96</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>15</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d_1/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1298688" shape="1,256,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d_1/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>15</dim>
					<dim>33</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>15</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/re_lu_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>15</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>15</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/max_pooling2d_1/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="3,3" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>15</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>7</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d_2/Conv2D/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="1299200" shape="384,256,3,3" size="1769472"/>
			<output>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d_2/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>7</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>384</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>5</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d_2/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="3068672" shape="1,384,1,1" size="768"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d_2/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>5</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>5</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/re_lu_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>5</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>5</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d_3/Conv2D/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="3069440" shape="384,384,3,3" size="2654208"/>
			<output>
				<port id="1" precision="FP16">
					<dim>384</dim>
					<dim>384</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d_3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>5</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>384</dim>
					<dim>384</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>3</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d_3/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="3068672" shape="1,384,1,1" size="768"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d_3/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>3</dim>
					<dim>12</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>3</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/re_lu_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>3</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>3</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d_4/Conv2D/ReadVariableOp/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="5723648" shape="256,384,3,3" size="1769472"/>
			<output>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>384</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d_4/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>3</dim>
					<dim>12</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>384</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d_4/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1298688" shape="1,256,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/functional_9/siamese_conv_embedding/conv2d_4/BiasAdd/Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Identity/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="10" to-port="1"/>
		<edge from-layer="10" from-port="2" to-layer="11" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="14" to-port="0"/>
		<edge from-layer="13" from-port="1" to-layer="14" to-port="1"/>
		<edge from-layer="14" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="16" to-port="1"/>
		<edge from-layer="16" from-port="2" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="19" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="19" to-port="1"/>
		<edge from-layer="19" from-port="2" to-layer="21" to-port="0"/>
		<edge from-layer="20" from-port="1" to-layer="21" to-port="1"/>
		<edge from-layer="21" from-port="2" to-layer="22" to-port="0"/>
		<edge from-layer="22" from-port="1" to-layer="24" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="1"/>
		<edge from-layer="24" from-port="2" to-layer="26" to-port="0"/>
		<edge from-layer="25" from-port="1" to-layer="26" to-port="1"/>
		<edge from-layer="26" from-port="2" to-layer="27" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value=""/>
		<cli_parameters>
			<blobs_as_inputs value="True"/>
			<caffe_parser_path value="DIR"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V2 value="False"/>
			<generate_deprecated_IR_V7 value="False"/>
			<generate_experimental_IR_V10 value="True"/>
			<input_model_is_text value="False"/>
			<k value="DIR\CustomLayersMapping.xml"/>
			<keep_quantize_ops_in_IR value="True"/>
			<keep_shape_ops value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="embedding_exemplar_subnet"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="True"/>
			<save_params_from_nd value="False"/>
			<saved_model_dir value="DIR"/>
			<scale value="255.0"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<stream_output value="False"/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_model, input_proto, input_shape, input_symbol, mean_file, mean_file_offsets, nd_prefix_name, output, placeholder_shapes, pretrained_model_name, saved_model_tags, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
